app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "value", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Pizza"], ["value", 10.0], ["restaurant_id", 2], ["created_at", "2021-06-05 22:38:24.686641"], ["updated_at", "2021-06-05 22:38:24.686641"]]