app/views/products/_form.html.erb

      <%= form.label  :restaurant %>
      <%= form.collection_select(:restaurant_id, Restaurant.order(:name), :id, :name, inclued_blank: true) %>
---
SELECT "restaurants".* FROM "restaurants" ORDER BY "restaurants"."name" ASC